In [4]:
cd

C:\Users\AI

In [5]:
cd Desktop/Flatiron/Phase_1/

C:\Users\AI\Desktop\Flatiron\Phase_1

In [6]:
cd dsc-phase-1-project/

C:\Users\AI\Desktop\Flatiron\Phase_1\dsc-phase-1-project

In [7]:
ls

 Volume in drive C has no label.
 Volume Serial Number is 4E05-06D0

 Directory of C:\Users\AI\Desktop\Flatiron\Phase_1\dsc-phase-1-project

08/10/2021  10:53 AM    <DIR>          .
08/10/2021  10:53 AM    <DIR>          ..
08/06/2021  11:09 AM               152 .canvas
08/06/2021  11:09 AM                80 .gitignore
08/06/2021  11:10 AM    <DIR>          .ipynb_checkpoints
08/06/2021  11:09 AM         1,425,341 awesome.gif
08/06/2021  11:09 AM             1,846 CONTRIBUTING.md
08/06/2021  11:09 AM             1,357 LICENSE.md
08/09/2021  03:49 PM             4,691 README.md
08/10/2021  10:53 AM               974 student.ipynb
08/06/2021  11:10 AM               588 Untitled.ipynb
08/10/2021  11:06 AM    <DIR>          zippedData
               8 File(s)      1,435,029 bytes
               4 Dir(s)  260,772,900,864 bytes free

In [8]:
cd zippedData

C:\Users\AI\Desktop\Flatiron\Phase_1\dsc-phase-1-project\zippedData

In [9]:
ls

 Volume in drive C has no label.
 Volume Serial Number is 4E05-06D0

 Directory of C:\Users\AI\Desktop\Flatiron\Phase_1\dsc-phase-1-project\zippedData

08/10/2021  11:06 AM    <DIR>          .
08/10/2021  11:06 AM    <DIR>          ..
08/09/2021  11:49 AM    <DIR>          .ipynb_checkpoints
08/06/2021  11:09 AM            53,544 bom.movie_gross.csv.gz
08/06/2021  11:09 AM        18,070,960 imdb.name.basics.csv.gz
08/06/2021  11:09 AM         5,599,979 imdb.title.akas.csv.gz
08/06/2021  11:09 AM         3,459,897 imdb.title.basics.csv.gz
08/06/2021  11:09 AM         1,898,523 imdb.title.crew.csv.gz
08/06/2021  11:09 AM        12,287,583 imdb.title.principals.csv.gz
08/06/2021  11:09 AM           539,530 imdb.title.ratings.csv.gz
08/10/2021  11:06 AM            48,331 Project_1.ipynb
08/06/2021  11:09 AM           498,202 rt.movie_info.tsv.gz
08/06/2021  11:09 AM         3,402,194 rt.reviews.tsv.gz
08/06/2021  11:09 AM           827,840 tmdb.movies.csv.gz
08/06/2021  11:09 AM           153,218 tn.movie_budgets.csv.gz
              12 File(s)     46,839,801 bytes
               3 Dir(s)  260,772,896,768 bytes free

In [10]:
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline

In [11]:
df = pd.read_csv('imdb.title.basics.csv.gz')
df1= pd.read_csv('imdb.name.basics.csv.gz')

In [12]:
df2= pd.read_csv('imdb.title.akas.csv.gz')
df3= pd.read_csv('imdb.title.crew.csv.gz')

In [13]:
df4= pd.read_csv('imdb.title.principals.csv.gz')
df5= pd.read_csv('imdb.title.ratings.csv.gz')

In [14]:
df6 = pd.read_csv('bom.movie_gross.csv.gz')

In [15]:
df.columns

Index(['tconst', 'primary_title', 'original_title', 'start_year',
       'runtime_minutes', 'genres'],
      dtype='object')

In [16]:
df.head()['start_year']

0    2013
1    2019
2    2018
3    2018
4    2017
Name: start_year, dtype: int64

In [17]:
df.head()
#

,tconst,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy"

In [18]:
df1.head()

,nconst,primary_name,birth_year,death_year,primary_profession,known_for_titles
0,nm0061671,Mary Ellen Bauder,NaN,NaN,"miscellaneous,production_manager,producer","tt0837562,tt2398241,tt0844471,tt0118553"
1,nm0061865,Joseph Bauer,NaN,NaN,"composer,music_department,sound_department","tt0896534,tt6791238,tt0287072,tt1682940"
2,nm0062070,Bruce Baum,NaN,NaN,"miscellaneous,actor,writer","tt1470654,tt0363631,tt0104030,tt0102898"
3,nm0062195,Axel Baumann,NaN,NaN,"camera_department,cinematographer,art_department","tt0114371,tt2004304,tt1618448,tt1224387"
4,nm0062798,Pete Baxter,NaN,NaN,"production_designer,art_department,set_decorator","tt0452644,tt0452692,tt3458030,tt2178256"

In [16]:
df2.head()

,title_id,ordering,title,region,language,types,attributes,is_original_title
0,tt0369610,10,Джурасик свят,BG,bg,NaN,NaN,0.0
1,tt0369610,11,Jurashikku warudo,JP,NaN,imdbDisplay,NaN,0.0
2,tt0369610,12,Jurassic World: O Mundo dos Dinossauros,BR,NaN,imdbDisplay,NaN,0.0
3,tt0369610,13,O Mundo dos Dinossauros,BR,NaN,NaN,short title,0.0
4,tt0369610,14,Jurassic World,FR,NaN,imdbDisplay,NaN,0.0

In [29]:
df3.head()

      tconst                      directors              writers
0  tt0285252                      nm0899854            nm0899854
1  tt0438973                            NaN  nm0175726,nm1802864
2  tt0462036                      nm1940585            nm1940585
3  tt0835418                      nm0151540  nm0310087,nm0841532
4  tt0878654  nm0089502,nm2291498,nm2292011            nm0284943

In [30]:
df4.head()

      tconst  ordering     nconst  category       job        characters
0  tt0111414         1  nm0246005     actor       NaN       ["The Man"]
1  tt0111414         2  nm0398271  director       NaN               NaN
2  tt0111414         3  nm3739909  producer  producer               NaN
3  tt0323808        10  nm0059247    editor       NaN               NaN
4  tt0323808         1  nm3579312   actress       NaN  ["Beth Boothby"]

In [17]:
df5.head()

       tconst  averagerating  numvotes
0  tt10356526            8.3        31
1  tt10384606            8.9       559
2   tt1042974            6.4        20
3   tt1043726            4.2     50352
4   tt1060240            6.5        21

In [28]:
df6.head()

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010

In [44]:
pd.concat([df4,df5])

,tconst,ordering,nconst,category,job,characters,averagerating,numvotes
0,tt0111414,1.0,nm0246005,actor,NaN,"[""The Man""]",NaN,NaN
1,tt0111414,2.0,nm0398271,director,NaN,NaN,NaN,NaN
2,tt0111414,3.0,nm3739909,producer,producer,NaN,NaN,NaN
3,tt0323808,10.0,nm0059247,editor,NaN,NaN,NaN,NaN
4,tt0323808,1.0,nm3579312,actress,NaN,"[""Beth Boothby""]",NaN,NaN
...,...,...,...,...,...,...,...,...
73851,tt9805820,NaN,NaN,NaN,NaN,NaN,8.1,25.0
73852,tt9844256,NaN,NaN,NaN,NaN,NaN,7.5,24.0
73853,tt9851050,NaN,NaN,NaN,NaN,NaN,4.7,14.0
73854,tt9886934,NaN,NaN,NaN,NaN,NaN,7.0,5.0
73855,tt9894098,NaN,NaN,NaN,NaN,NaN,6.3,128.0

In [53]:
df4.merge(df5)

,tconst,ordering,nconst,category,job,characters,averagerating,numvotes
0,tt0323808,10,nm0059247,editor,NaN,NaN,3.9,2328
1,tt0323808,1,nm3579312,actress,NaN,"[""Beth Boothby""]",3.9,2328
2,tt0323808,2,nm2694680,actor,NaN,"[""Steve Thomson""]",3.9,2328
3,tt0323808,3,nm0574615,actor,NaN,"[""Sir Lachlan Morrison""]",3.9,2328
4,tt0323808,4,nm0502652,actress,NaN,"[""Lady Delia Morrison""]",3.9,2328
...,...,...,...,...,...,...,...,...
629750,tt9681728,5,nm10436661,director,NaN,NaN,6.6,34
629751,tt9681728,6,nm7442758,producer,producer,NaN,6.6,34
629752,tt9681728,7,nm9645603,cinematographer,NaN,NaN,6.6,34
629753,tt9681728,8,nm10436663,actor,NaN,"[""Makar Petrovich""]",6.6,34
629754,tt9681728,9,nm10397910,actor,NaN,"[""Corpsman""]",6.6,34

In [59]:
df4.join(df5.set_index('tconst'), on='tconst')

,tconst,ordering,nconst,category,job,characters,averagerating,numvotes
0,tt0111414,1,nm0246005,actor,NaN,"[""The Man""]",NaN,NaN
1,tt0111414,2,nm0398271,director,NaN,NaN,NaN,NaN
2,tt0111414,3,nm3739909,producer,producer,NaN,NaN,NaN
3,tt0323808,10,nm0059247,editor,NaN,NaN,3.9,2328.0
4,tt0323808,1,nm3579312,actress,NaN,"[""Beth Boothby""]",3.9,2328.0
...,...,...,...,...,...,...,...,...
1028181,tt9692684,1,nm0186469,actor,NaN,"[""Ebenezer Scrooge""]",NaN,NaN
1028182,tt9692684,2,nm4929530,self,NaN,"[""Herself"",""Regan""]",NaN,NaN
1028183,tt9692684,3,nm10441594,director,NaN,NaN,NaN,NaN
1028184,tt9692684,4,nm6009913,writer,writer,NaN,NaN,NaN
1028185,tt9692684,5,nm10441595,producer,producer,NaN,NaN,NaN